Repository: fau-klue/ai-act-corpus
Catalog: corpus/tmx_files/AI_Act-EN-PT-Trados.tmx
Source language: en_gb
Languages: pt_pt

source: upon a reasoned request of a national competent authority, demonstrate the conformity of the high-risk AI system with the requirements set out in Section 2;
pt_pt: Mediante pedido fundamentado de uma autoridade nacional competente, demonstrar a conformidade do sistema de IA de risco elevado com os requisitos estabelecidos na secção 2;

source: ensure that the high-risk AI system complies with accessibility requirements in accordance with Directives (EU) 2016/2102 and (EU) 2019/882.
pt_pt: Assegurar que o sistema de IA de risco elevado cumpra os requisitos de acessibilidade em conformidade com as Diretivas (UE) 2016/2102 e (UE) 2019/882.

source: Article 17
pt_pt: Artigo 17.o

source: Quality management system
pt_pt: Sistema de gestão da qualidade

source: Providers of high-risk AI systems shall put a quality management system in place that ensures compliance with this Regulation.
pt_pt: Os prestadores de sistemas de IA de risco elevado devem criar um sistema de gestão da qualidade que assegure a conformidade com o presente regulamento.

source: That system shall be documented in a systematic and orderly manner in the form of written policies, procedures and instructions, and shall include at least the following aspects:
pt_pt: Esse sistema deve estar documentado de maneira sistemática e ordenada, sob a forma de políticas, procedimentos e instruções escritos, e incluir, no mínimo, os seguintes aspetos:

source: a strategy for regulatory compliance, including compliance with conformity assessment procedures and procedures for the management of modifications to the high-risk AI system;
pt_pt: Uma estratégia para o cumprimento da regulamentação, incluindo a observância de procedimentos de avaliação da conformidade e de procedimentos de gestão de modificações do sistema de IA de risco elevado;

source: techniques, procedures and systematic actions to be used for the design, design control and design verification of the high-risk AI system;
pt_pt: Técnicas, procedimentos e ações sistemáticas a utilizar para a conceção, controlo da conceção e verificação da conceção do sistema de IA de risco elevado;

source: techniques, procedures and systematic actions to be used for the development, quality control and quality assurance of the high-risk AI system;
pt_pt: Técnicas, procedimentos e ações sistemáticas a utilizar para o desenvolvimento, controlo da qualidade e garantia da qualidade do sistema de IA de risco elevado;

source: examination, test and validation procedures to be carried out before, during and after the development of the high-risk AI system, and the frequency with which they have to be carried out;
pt_pt: Procedimentos de exame, teste e validação a realizar antes, durante e após o desenvolvimento do sistema de IA de risco elevado e a frequência com a qual têm de ser realizados;

source: technical specifications, including standards, to be applied and, where the relevant harmonised standards are not applied in full or do not cover all of the relevant requirements set out in Section 2, the means to be used to ensure that the high-risk AI system complies with those requirements;
pt_pt: Especificações técnicas, incluindo normas, a aplicar e, se as normas harmonizadas em causa não forem aplicadas na íntegra, ou não abrangerem todos os requisitos pertinentes estabelecidos na secção 2, os meios a usar para assegurar que o sistema de IA de risco elevado cumpra esses requisitos;

source: systems and procedures for data management, including data acquisition, data collection, data analysis, data labelling, data storage, data filtration, data mining, data aggregation, data retention and any other operation regarding the data that is performed before and for the purpose of the placing on the market or the putting into service of high-risk AI systems;
pt_pt: Sistemas e procedimentos de gestão de dados, incluindo aquisição de dados, recolha de dados, análise de dados, rotulagem de dados, armazenamento de dados, filtragem de dados, prospeção de dados, agregação de dados, conservação de dados e qualquer outra operação relativa aos dados que seja realizada antes e para efeitos da colocação no mercado ou colocação em serviço de sistemas de IA de risco elevado;

source: the risk management system referred to in Article 9;
pt_pt: O sistema de gestão de riscos a que se refere o artigo 9.o;

source: the setting-up, implementation and maintenance of a post-market monitoring system, in accordance with Article 72;
pt_pt: O estabelecimento, aplicação e manutenção de um sistema de acompanhamento pós-comercialização, nos termos do artigo 72.o;

source: procedures related to the reporting of a serious incident in accordance with Article 73;
pt_pt: Procedimentos de comunicação de um incidente grave em conformidade com o artigo 73.o;

source: the handling of communication with national competent authorities, other relevant authorities, including those providing or supporting the access to data, notified bodies, other operators, customers or other interested parties;
pt_pt: A gestão da comunicação com autoridades nacionais competentes, outras autoridades pertinentes, incluindo as que disponibilizam ou apoiam o acesso a dados, organismos notificados, outros operadores, clientes ou outras partes interessadas;

source: systems and procedures for record-keeping of all relevant documentation and information;
pt_pt: Sistemas e procedimentos de manutenção de registos de toda a documentação e informação pertinente;

source: resource management, including security-of-supply related measures;
pt_pt: Gestão de recursos, incluindo medidas relacionadas com a segurança do aprovisionamento;

source: an accountability framework setting out the responsibilities of the management and other staff with regard to all the aspects listed in this paragraph.
pt_pt: Um regime que defina as responsabilidades do pessoal com funções de gestão e do restante pessoal no atinente a todos os aspetos elencados no presente número.

source: The implementation of the aspects referred to in paragraph 1 shall be proportionate to the size of the provider’s organisation.
pt_pt: A aplicação dos aspetos referidos no n.o 1 deve ser proporcionada à dimensão da organização do prestador.

source: Providers shall, in any event, respect the degree of rigour and the level of protection required to ensure the compliance of their high-risk AI systems with this Regulation.
pt_pt: Os prestadores devem, em qualquer caso, respeitar o grau de rigor e o nível de proteção necessários para garantir a conformidade dos seus sistemas de IA de risco elevado com o presente regulamento.

source: Providers of high-risk AI systems that are subject to obligations regarding quality management systems or an equivalent function under relevant sectoral Union law may include the aspects listed in paragraph 1 as part of the quality management systems pursuant to that law.
pt_pt: Os prestadores de sistemas de IA de risco elevado sujeitos a obrigações relativas aos sistemas de gestão da qualidade ou a uma função equivalente nos termos da legislação setorial aplicável da União podem incluir os aspetos enumerados no n.o 1 como parte dos sistemas de gestão da qualidade estabelecidos nos termos dessa legislação.

source: For providers that are financial institutions subject to requirements regarding their internal governance, arrangements or processes under Union financial services law, the obligation to put in place a quality management system, with the exception of paragraph 1, points (g), (h) and (i) of this Article, shall be deemed to be fulfilled by complying with the rules on internal governance arrangements or processes pursuant to the relevant Union financial services law.
pt_pt: Para os prestadores que sejam instituições financeiras sujeitas a requisitos em matéria de governação, mecanismos ou processos internos nos termos do direito da União no domínio dos serviços financeiros, considera-se que a obrigação de criar um sistema de gestão da qualidade, com exceção do n.o 1, alíneas g), h) e i) do presente artigo, é satisfeita mediante o cumprimento das regras em matéria de governação, mecanismos ou processos internos nos termos do direito da União aplicável no domínio dos serviços financeiros.

source: To that end, any harmonised standards referred to in Article 40 shall be taken into account.
pt_pt: Para o efeito, devem ser tidas em conta as eventuais normas harmonizadas a que se refere o artigo 40.o.

source: Article 18
pt_pt: Artigo 18.o

source: Documentation keeping
pt_pt: Manutenção de documentação

source: The provider shall, for a period ending 10 years after the high-risk AI system has been placed on the market or put into service, keep at the disposal of the national competent authorities:
pt_pt: O prestador deve manter à disposição das autoridades nacionais competentes, durante os 10 anos subsequentes à data de colocação no mercado ou de colocação em serviço do sistema de IA de risco elevado:

source: the technical documentation referred to in Article 11;
pt_pt: A documentação técnica a que se refere o artigo 11.o;

source: the documentation concerning the quality management system referred to in Article 17;
pt_pt: A documentação relativa ao sistema de gestão da qualidade a que se refere o artigo 17.o;

source: the documentation concerning the changes approved by notified bodies, where applicable;
pt_pt: A documentação relativa às alterações aprovadas pelos organismos notificados, se for caso disso;

source: the decisions and other documents issued by the notified bodies, where applicable;
pt_pt: As decisões e outros documentos emitidos pelos organismos notificados, se for caso disso;

source: the EU declaration of conformity referred to in Article 47.
pt_pt: A declaração UE de conformidade a que se refere o artigo 47.o.

source: Each Member State shall determine conditions under which the documentation referred to in paragraph 1 remains at the disposal of the national competent authorities for the period indicated in that paragraph for the cases when a provider or its authorised representative established on its territory goes bankrupt or ceases its activity prior to the end of that period.
pt_pt: Cada Estado-Membro determina as condições em que a documentação a que se refere o n.o 1 permanece à disposição das autoridades nacionais competentes durante o período indicado nesse número, nos casos em que um prestador ou o seu mandatário estabelecido no seu território falir ou cessar a sua atividade antes do termo desse período.

source: Providers that are financial institutions subject to requirements regarding their internal governance, arrangements or processes under Union financial services law shall maintain the technical documentation as part of the documentation kept under the relevant Union financial services law.
pt_pt: Os prestadores que sejam instituições financeiras sujeitas a requisitos em matéria de governação, mecanismos ou processos internos nos termos do direito da União no domínio dos serviços financeiros devem manter a documentação técnica como parte da documentação conservada nos termos do direito da União aplicável no domínio dos serviços financeiros.

source: Article 19
pt_pt: Artigo 19.o

source: Automatically generated logs
pt_pt: Registos gerados automaticamente

source: Providers of high-risk AI systems shall keep the logs referred to in Article 12(1), automatically generated by their high-risk AI systems, to the extent such logs are under their control.
pt_pt: Os prestadores de sistemas de IA de risco elevado devem manter os registos, a que se refere o artigo 12.o, n.o 1, gerados automaticamente pelos seus sistemas de IA de risco elevado, desde que esses registos estejam sob o seu controlo.

source: Without prejudice to applicable Union or national law, the logs shall be kept for a period appropriate to the intended purpose of the high-risk AI system, of at least six months, unless provided otherwise in the applicable Union or national law, in particular in Union law on the protection of personal data.
pt_pt: Sem prejuízo do direito da União ou do direito nacional aplicável, os registos devem ser conservados por um período adequado à finalidade prevista do sistema de IA de risco elevado, de pelo menos seis meses, salvo disposição em contrário no direito da União ou do direito nacional aplicável, em especial no direito da União em matéria de proteção de dados pessoais.

source: Providers that are financial institutions subject to requirements regarding their internal governance, arrangements or processes under Union financial services law shall maintain the logs automatically generated by their high-risk AI systems as part of the documentation kept under the relevant financial services law.
pt_pt: Os prestadores que sejam instituições financeiras sujeitas a requisitos em matéria de governação, mecanismos ou processos internos nos termos do direito da União no domínio dos serviços financeiros devem manter os registos gerados automaticamente pelos sistemas de IA de risco elevado que disponibilizam como parte da documentação conservada nos termos da legislação aplicável no domínio dos serviços financeiros.

source: Article 20
pt_pt: Artigo 20.o

source: Corrective actions and duty of information
pt_pt: Medidas corretivas e dever de informação

source: Providers of high-risk AI systems which consider or have reason to consider that a high-risk AI system that they have placed on the market or put into service is not in conformity with this Regulation shall immediately take the necessary corrective actions to bring that system into conformity, to withdraw it, to disable it, or to recall it, as appropriate.
pt_pt: Os prestadores de sistemas de IA de risco elevado que considerem ou tenham motivos para crer que um sistema de IA de risco elevado que colocaram no mercado ou colocaram em serviço não está em conformidade com o presente regulamento devem imediatamente tomar as medidas corretivas necessárias para repor a conformidade do sistema em questão, proceder à sua retirada, desativação ou à recolha do mesmo, consoante o caso.

source: They shall inform the distributors of the high-risk AI system concerned and, where applicable, the deployers, the authorised representative and importers accordingly.
pt_pt: Devem informar do facto os distribuidores do sistema de IA de risco elevado em questão e, se for caso disso, os responsáveis pela implantação, o mandatário e os importadores.

source: Where the high-risk AI system presents a risk within the meaning of Article 79(1) and the provider becomes aware of that risk, it shall immediately investigate the causes, in collaboration with the reporting deployer, where applicable, and inform the market surveillance authorities competent for the high-risk AI system concerned and, where applicable, the notified body that issued a certificate for that high-risk AI system in accordance with Article 44, in particular, of the nature of the non-compliance and of any relevant corrective action taken.
pt_pt: Se o sistema de IA de risco elevado apresentar um risco na aceção do artigo 79.o, n.o 1, e o prestador tomar conhecimento desse risco, o prestador deve imediatamente investigar as causas, em colaboração com o responsável pela implantação que tenha comunicado informações a esse respeito, se for o caso, e informar as autoridades de fiscalização do mercado competentes para o sistema de IA de elevado risco em causa e, se for o caso, o organismo notificado que emitiu um certificado para o sistema de IA de risco elevado em conformidade com o artigo 44.o, em especial sobre a natureza da não conformidade e as medidas corretivas tomadas.

source: Article 21
pt_pt: Artigo 21.o

source: Cooperation with competent authorities
pt_pt: Cooperação com as autoridades competentes

source: Providers of high-risk AI systems shall, upon a reasoned request by a competent authority, provide that authority all the information and documentation necessary to demonstrate the conformity of the high-risk AI system with the requirements set out in Section 2, in a language which can be easily understood by the authority in one of the official languages of the institutions of the Union as indicated by the Member State concerned.
pt_pt: Os prestadores de sistemas de IA de risco elevado devem, mediante pedido fundamentado de uma autoridade competente, prestar a essa autoridade todas as informações e documentação necessárias para demonstrar a conformidade do sistema de IA de risco elevado com os requisitos estabelecidos na secção 2, numa língua que possa ser facilmente compreendida pela autoridade numa das línguas oficiais das instituições da União indicada pelo Estado-Membro em questão.

source: Upon a reasoned request by a competent authority, providers shall also give the requesting competent authority, as applicable, access to the automatically generated logs of the high-risk AI system referred to in Article 12(1), to the extent such logs are under their control.
pt_pt: Mediante pedido fundamentado de uma autoridade competente, os prestadores devem igualmente conceder a essa autoridade, consoante o caso, o acesso aos registos gerados automaticamente do sistema de IA de risco elevado a que se refere o artigo 12.o, n.o 1, desde que esses registos estejam sob o seu controlo.

source: Any information obtained by a competent authority pursuant to this Article shall be treated in accordance with the confidentiality obligations set out in Article 78.
pt_pt: Todas as informações que uma autoridade competente obtenha nos termos do presente artigo devem ser tratadas nos termos das obrigações de confidencialidade estabelecidas no artigo 78.o.

source: Article 22
pt_pt: Artigo 22.o

source: Authorised representatives of providers of high-risk AI systems
pt_pt: Mandatários dos prestadores de sistemas de IA de risco elevado

source: Prior to making their high-risk AI systems available on the Union market, providers established in third countries shall, by written mandate, appoint an authorised representative which is established in the Union.
pt_pt: Antes de disponibilizarem os seus sistemas de IA de risco elevado no mercado da União, os prestadores estabelecidos em países terceiros devem, através de mandato escrito, designar um mandatário estabelecido na União.

source: The provider shall enable its authorised representative to perform the tasks specified in the mandate received from the provider.
pt_pt: O prestador deve habilitar o seu mandatário a desempenhar as funções especificadas no mandato conferido pelo prestador.

source: The authorised representative shall perform the tasks specified in the mandate received from the provider.
pt_pt: O mandatário deve desempenhar as funções especificadas no mandato conferido pelo prestador.

source: It shall provide a copy of the mandate to the market surveillance authorities upon request, in one of the official languages of the institutions of the Union, as indicated by the competent authority.
pt_pt: Mediante pedido, o mandatário deve apresentar uma cópia do mandato às autoridades de fiscalização do mercado, numa das línguas oficiais das instituições da União indicada pela autoridade competente.

source: For the purposes of this Regulation, the mandate shall empower the authorised representative to carry out the following tasks:
pt_pt: Para efeitos do presente regulamento, o mandato habilita o mandatário a desempenhar as seguintes funções:

source: verify that the EU declaration of conformity referred to in Article 47 and the technical documentation referred to in Article 11 have been drawn up and that an appropriate conformity assessment procedure has been carried out by the provider;
pt_pt: Verificar se a declaração UE de conformidade referida no artigo 47.o e a documentação técnica a que se refere o artigo 11.o foram elaboradas e se o prestador efetuou um procedimento de avaliação da conformidade adequado;

source: keep at the disposal of the competent authorities and national authorities or bodies referred to in Article 74(10), for a period of 10 years after the high-risk AI system has been placed on the market or put into service, the contact details of the provider that appointed the authorised representative, a copy of the EU declaration of conformity referred to in Article 47, the technical documentation and, if applicable, the certificate issued by the notified body;
pt_pt: Manter à disposição das autoridades competentes e das autoridades ou organismos nacionais a que se refere o artigo 74.o, n.o 10, durante os 10 anos subsequentes à data de colocação no mercado ou colocação em serviço do sistema de IA de risco elevado, os dados de contacto do prestador que designou o mandatário, uma cópia da declaração UE de conformidade referida no artigo 47.o, a documentação técnica e, se aplicável, o certificado emitido pelo organismo notificado;

source: provide a competent authority, upon a reasoned request, with all the information and documentation, including that referred to in point (b) of this subparagraph, necessary to demonstrate the conformity of a high-risk AI system with the requirements set out in Section 2, including access to the logs, as referred to in Article 12(1), automatically generated by the high-risk AI system, to the extent such logs are under the control of the provider;
pt_pt: Prestar a uma autoridade competente, mediante pedido fundamentado, todas as informações e documentação, inclusive aquelas a que se refere a alínea b) do presente parágrafo, necessárias para demonstrar a conformidade de um sistema de IA de risco elevado com os requisitos estabelecidos na secção 2 do presente título, incluindo o acesso aos registos, conforme referido no artigo 12.o, n.o 1, gerados automaticamente pelo sistema de IA de risco elevado, desde que esses registos estejam sob o controlo do prestador;

source: cooperate with competent authorities, upon a reasoned request, in any action the latter take in relation to the high-risk AI system, in particular to reduce and mitigate the risks posed by the high-risk AI system;
pt_pt: Cooperar com as autoridades competentes, mediante pedido fundamentado, em qualquer ação que estas empreendam em relação ao sistema de IA de risco elevado, nomeadamente para reduzir e atenuar os riscos colocados pelo mesmo;

source: where applicable, comply with the registration obligations referred to in Article 49(1), or, if the registration is carried out by the provider itself, ensure that the information referred to in point 3 of Section A of Annex VIII is correct.
pt_pt: Se for o caso, cumprir as obrigações de registo a que se refere o artigo 49.o, n.o 1, ou, se o registo for efetuado pelo próprio prestador, assegurar que as informações a que se refere o ponto 3 da secção A do anexo VIII, estejam corretas.

source: The mandate shall empower the authorised representative to be addressed, in addition to or instead of the provider, by the competent authorities, on all issues related to ensuring compliance with this Regulation.
pt_pt: O mandato habilita o mandatário a ser contactado, em complemento ou em alternativa ao prestador, pelas autoridades competentes, sobre todas as questões relacionadas com a garantia do cumprimento do presente regulamento.

source: The authorised representative shall terminate the mandate if it considers or has reason to consider the provider to be acting contrary to its obligations pursuant to this Regulation.
pt_pt: O mandatário põe termo ao mandato se considerar ou tiver razões para considerar que o prestador age de forma contrária às obrigações que lhe incumbem por força do presente regulamento.
